# Student Grades Analysis
This notebook calculates and displays average grades for a group of students across three subjects: Math, English, and Science.

In [3]:
import pandas as pd

In [4]:
grades = pd.DataFrame({
    'Name': ['John', 'Mary', 'Tolu', 'Zara'],
    'Math': [85, 78, 92, 88],
    'English': [75, 82, 89, 91],
    'Science': [90, 85, 94, 86]
})

grades.head()

   Name  Math  English  Science
0  John    85       75       90
1  Mary    78       82       85
2  Tolu    92       89       94
3  Zara    88       91       86

In [5]:
grades['Average'] = grades[['Math', 'English', 'Science']].mean(axis=1)

In [6]:
grades

   Name  Math  English  Science    Average
0  John    85       75       90  83.333333
1  Mary    78       82       85  81.666667
2  Tolu    92       89       94  91.666667
3  Zara    88       91       86  88.333333